<a href="https://colab.research.google.com/github/19PA1A0291/AI-LAB/blob/master/Welcome_To_Colaboratory.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

 PANDAS
 
EXPERIMENT-2
 
1) Create a dataframe manually

In [132]:
 import pandas as pd
import numpy as np
df=pd.DataFrame({"Roll No":["EEE291","EEE290","EEE296"],"Name":["S.M.S Manohar","S.venisha","T.praneetha"]})
df

  Roll No           Name
0  EEE291  S.M.S Manohar
1  EEE290      S.venisha
2  EEE296    T.praneetha

 2) Import data into a Data Frame.

In [133]:
 import pandas as pd
import numpy as np
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

 3)Adding,Deleting,Modifying the rows/columns in a dataframe
 
3.1) Adding a column

In [134]:
 host_day = pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [135]:
 host_day.shape

(117, 1)

In [136]:
 df["hostler/dayscholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostler/dayscholar
0        1      M  ...       Not placed                   d
1        2      F  ...           Placed                   d
2        3      F  ...       Not placed                   d
3        4      M  ...       Not placed                   d
4        5      M  ...       Not placed                   h

[5 rows x 10 columns]

 3.2) Deleting a column.

In [137]:
 del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/dayscholar
0        1      M       A  ...        18        Not placed                   d
1        2      F       A  ...         0            Placed                   d
2        3      F       A  ...        13        Not placed                   d
3        4      M       A  ...        17        Not placed                   d
4        5      M       A  ...        17        Not placed                   h

[5 rows x 9 columns]

 3.3)Adding a row

In [138]:
 df1 = pd.DataFrame({"Rollno":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_peecentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     118      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [139]:
 df=df.append(df)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/dayscholar
0        1      M       A  ...        18        Not placed                   d
1        2      F       A  ...         0            Placed                   d
2        3      F       A  ...        13        Not placed                   d
3        4      M       A  ...        17        Not placed                   d
4        5      M       A  ...        17        Not placed                   h

[5 rows x 9 columns]

 3.4) Deleting a row.

In [140]:
 df=df.drop(3)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/dayscholar
0        1      M       A  ...        18        Not placed                   d
1        2      F       A  ...         0            Placed                   d
2        3      F       A  ...        13        Not placed                   d
4        5      M       A  ...        17        Not placed                   h
5        6      M       A  ...         6        Not placed                   h

[5 rows x 9 columns]

 3.5) Modifying elements.

In [141]:
 df.loc[1,'hostler/days scholar']='h'
df.head()

   Roll No Gender  ... hostler/dayscholar  hostler/days scholar
0        1      M  ...                  d                   NaN
1        2      F  ...                  d                     h
2        3      F  ...                  d                   NaN
4        5      M  ...                  h                   NaN
5        6      M  ...                  h                   NaN

[5 rows x 10 columns]

 4) Applying functions on a dataframe.

In [142]:
def gracep(x):
  if(x<70):
    return(x+0.05)
  else:
    return(x)

In [143]:
 df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(gracep)
df.head()

   Roll No Gender  ... hostler/dayscholar  hostler/days scholar
0        1      M  ...                  d                   NaN
1        2      F  ...                  d                     h
2        3      F  ...                  d                   NaN
4        5      M  ...                  h                   NaN
5        6      M  ...                  h                   NaN

[5 rows x 10 columns]

 5) iterations on dataframe.

In [144]:
 for index,row in df[df["B.Tech_percentage"]>=80].iterrows():
      print(row["Roll No"],"-",row["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38
18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

 6)Accessing the elements from a dataframe.

In [145]:
 df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
1            89.0                      92.4
2            67.0                      68.0
2            67.0                      68.0

 7)Different ways to deal with NA's in dataframe.

In [146]:
 df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... hostler/dayscholar  hostler/days scholar
0        1      M  ...                  d                   NaN
1        2      F  ...                  d                     h
2        3      F  ...                  d                   NaN
4        5      M  ...                  h                   NaN
5        6      M  ...                  h                   NaN

[5 rows x 10 columns]

 8) Groupby operations on dataframe.

In [147]:
 grouped=df.groupby("Gender")
grouped["B.Tech_percentage"].agg(np.mean)

Gender
F    71.216735
M    57.343881
Name: B.Tech_percentage, dtype: float64

 9) Merging the dataframes.

In [148]:
 df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [149]:
 df=pd.merge(df,df2,on="Roll No")
df.head()

   Roll No Gender Section  ...  hostler/dayscholar  hostler/days scholar  Urban/Rural
0        1      M       A  ...                   d                   NaN        Urban
1        1      M       A  ...                   d                   NaN        Urban
2        2      F       A  ...                   d                     h        Rural
3        2      F       A  ...                   d                     h        Rural
4        3      F       A  ...                   d                   NaN        Urban

[5 rows x 11 columns]

To execute the code in the above cell, select it with a click and then either press the play button to the left of the code, or use the keyboard shortcut "Command/Ctrl+Enter". To edit the code, just click the cell and start editing.

Variables that you define in one cell can later be used in other cells:

In [150]:
seconds_in_a_week = 7 * seconds_in_a_day
seconds_in_a_week

NameError: ignored

Colab notebooks allow you to combine **executable code** and **rich text** in a single document, along with **images**, **HTML**, **LaTeX** and more. When you create your own Colab notebooks, they are stored in your Google Drive account. You can easily share your Colab notebooks with co-workers or friends, allowing them to comment on your notebooks or even edit them. To learn more, see [Overview of Colab](/notebooks/basic_features_overview.ipynb). To create a new Colab notebook you can use the File menu above, or use the following link: [create a new Colab notebook](http://colab.research.google.com#create=true).

Colab notebooks are Jupyter notebooks that are hosted by Colab. To learn more about the Jupyter project, see [jupyter.org](https://www.jupyter.org).

## Data science

With Colab you can harness the full power of popular Python libraries to analyze and visualize data. The code cell below uses **numpy** to generate some random data, and uses **matplotlib** to visualize it. To edit the code, just click the cell and start editing.

In [ ]:
import numpy as np
from matplotlib import pyplot as plt

ys = 200 + np.random.randn(100)
x = [x for x in range(len(ys))]

plt.plot(x, ys, '-')
plt.fill_between(x, ys, 195, where=(ys > 195), facecolor='g', alpha=0.6)

plt.title("Sample Visualization")
plt.show()

You can import your own data into Colab notebooks from your Google Drive account, including from spreadsheets, as well as from Github and many other sources. To learn more about importing data, and how Colab can be used for data science, see the links below under [Working with Data](#working-with-data).

## Machine learning

With Colab you can import an image dataset, train an image classifier on it, and evaluate the model, all in just [a few lines of code](https://colab.research.google.com/github/tensorflow/docs/blob/master/site/en/tutorials/quickstart/beginner.ipynb). Colab notebooks execute code on Google's cloud servers, meaning you can leverage the power of Google hardware, including [GPUs and TPUs](#using-accelerated-hardware), regardless of the power of your machine. All you need is a browser.

Colab is used extensively in the machine learning community with applications including:
- Getting started with TensorFlow
- Developing and training neural networks
- Experimenting with TPUs
- Disseminating AI research
- Creating tutorials

To see sample Colab notebooks that demonstrate machine learning applications, see the [machine learning examples](#machine-learning-examples) below.

## More Resources

### Working with Notebooks in Colab
- [Overview of Colaboratory](/notebooks/basic_features_overview.ipynb)
- [Guide to Markdown](/notebooks/markdown_guide.ipynb)
- [Importing libraries and installing dependencies](/notebooks/snippets/importing_libraries.ipynb)
- [Saving and loading notebooks in GitHub](https://colab.research.google.com/github/googlecolab/colabtools/blob/master/notebooks/colab-github-demo.ipynb)
- [Interactive forms](/notebooks/forms.ipynb)
- [Interactive widgets](/notebooks/widgets.ipynb)
- <img src="/img/new.png" height="20px" align="left" hspace="4px" alt="New"></img>
 [TensorFlow 2 in Colab](/notebooks/tensorflow_version.ipynb)

<a name="working-with-data"></a>
### Working with Data
- [Loading data: Drive, Sheets, and Google Cloud Storage](/notebooks/io.ipynb) 
- [Charts: visualizing data](/notebooks/charts.ipynb)
- [Getting started with BigQuery](/notebooks/bigquery.ipynb)

### Machine Learning Crash Course
These are a few of the notebooks from Google's online Machine Learning course. See the [full course website](https://developers.google.com/machine-learning/crash-course/) for more.
- [Intro to Pandas](/notebooks/mlcc/intro_to_pandas.ipynb)
- [Tensorflow concepts](/notebooks/mlcc/tensorflow_programming_concepts.ipynb)
- [First steps with TensorFlow](/notebooks/mlcc/first_steps_with_tensor_flow.ipynb)
- [Intro to neural nets](/notebooks/mlcc/intro_to_neural_nets.ipynb)
- [Intro to sparse data and embeddings](/notebooks/mlcc/intro_to_sparse_data_and_embeddings.ipynb)

<a name="using-accelerated-hardware"></a>
### Using Accelerated Hardware
- [TensorFlow with GPUs](/notebooks/gpu.ipynb)
- [TensorFlow with TPUs](/notebooks/tpu.ipynb)

<a name="machine-learning-examples"></a>

## Machine Learning Examples

To see end-to-end examples of the interactive machine learning analyses that Colaboratory makes possible, check out these  tutorials using models from [TensorFlow Hub](https://tfhub.dev).

A few featured examples:

- [Retraining an Image Classifier](https://tensorflow.org/hub/tutorials/tf2_image_retraining): Build a Keras model on top of a pre-trained image classifier to distinguish flowers.
- [Text Classification](https://tensorflow.org/hub/tutorials/tf2_text_classification): Classify IMDB movie reviews as either *positive* or *negative*.
- [Style Transfer](https://tensorflow.org/hub/tutorials/tf2_arbitrary_image_stylization): Use deep learning to transfer style between images.
- [Multilingual Universal Sentence Encoder Q&A](https://tensorflow.org/hub/tutorials/retrieval_with_tf_hub_universal_encoder_qa): Use a machine learning model to answer questions from the SQuAD dataset.
- [Video Interpolation](https://tensorflow.org/hub/tutorials/tweening_conv3d): Predict what happened in a video between the first and the last frame.